# GetCoordinatePlaneReferenceXZ Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..GetCoordinatePlaneReferenceXZ Method
ReferencePoint Class See Also
---
A reference for the XZ plane of the coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetCoordinatePlaneReferenceXZ()
```

Visual Basic
---
```text
Public Function GetCoordinatePlaneReferenceXZ As Reference
```

Visual C++
---
```text
public:
Reference^ GetCoordinatePlaneReferenceXZ()
```

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace